delivery_carrier_seur/docs/seur/template/picking_send_cdata.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:imp="http://localhost:7026/ImprimirECBWebService">
    <soapenv:Header/>
    <soapenv:Body>
        <imp:impresionIntegracionConECBWS>
            <imp:in0>${username}</imp:in0>
            <imp:in1>${password}</imp:in1>
            <imp:in2>${printer}</imp:in2>
            <imp:in3>${printer_model}</imp:in3>
            <imp:in4>${ecb_code}</imp:in4>
            <imp:in5>
                <![CDATA[<?xml version="1.0" encoding="ISO-8859-1"?>
                ${cdata}
                ]]>
            </imp:in5>
            <imp:in6>fichero.xml</imp:in6>
            <imp:in7>${vat}</imp:in7>
            <imp:in8>${franchise}</imp:in8>
            <imp:in9>-1</imp:in9>
            <imp:in10>${seurid}</imp:in10>
        </imp:impresionIntegracionConECBWS>
    </soapenv:Body>
</soapenv:Envelope>
